2D_riblet/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          136;
        startFace       5936;
    }
    upperWall
    {
        type            patch;
        nFaces          92;
        startFace       6072;
    }
    leftWall
    {
        type            patch;
        nFaces          30;
        startFace       6164;
    }
    rightWall
    {
        type            patch;
        nFaces          30;
        startFace       6194;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          6080;
        startFace       6224;
    }
)

// ************************************************************************* //
