2D_riblet/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeIfPresent "../parameters.dat"

defaultFieldValues
(
    volScalarFieldValue alpha.biofilm 0
);

regions
(
    boxToCell
    {
        box (0 0 -1) ($bf_length $bf_thickness 1);
        fieldValues
        (
            volScalarFieldValue alpha.biofilm 0
        );
    }
);


// ************************************************************************* //
